// 2.Реализуйте алгоритм сортировки пузырьком числового массива, результат после каждой итерации запишите в лог-файл.
package Homework.Seminar02;
public class Task2 {
    public static void main(String[] args) {
        System.out.println("Hello world");
    }
}
